> 77p 하지만 난 지금 대담해진 상태다
> 96p 지금 하는 일을 중단하지 않아야 하니까

TDD 중간에 사소한 단계들을 건너뛰고 싶은 생각이 자주 듦. 이론적으로는 건너뛰지 말고 바보같을지라도 모든 절차를 순서대로 하나하나 밟아야 함. 하지만 현실적으로는, 저자가 본문에 써놨듯, 종종 건너뛰게 됨. 
건너 뛰어도 될 것을 건너뛰느냐 그렇지 않은 것을 건너뛰느냐가 TDD의 능숙도를 가르는 것 같음.

> 84p 하지만 현재는 통화 개념같은게 없고, 통화 개념을 도입할 충분한 이유가 없어 보이므로 잠시 동안은 이대로 두자.

TDD는 정말 훈련이라고 느껴짐. 자신과의 싸움. 구현 욕구와의 싸움

> 90p 어떤 클라이언트 코드도 Dollar라는 이름의 하위 클래스가 있다는 사실을 알지 못한다.

하위 클래스를 지우려는 시도는 제대로 해보지 않은 것 같은데, 아예 이것을 목표로 하는 패턴도 좋은 것 같다. 
클라쪽에서는(이 클래스를 사용하는 쪽에서는) 내부 구현을 알 필요가 없으니 최대한 감추는 것이 좋으므로.
테스트 코드에서도 하위 클래스가 사라지면 중복되는 각 클래스별 테스트 코드를 없앨 수도 있음.
